---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.TorsionalModulus
source: html/c858f8ce-3bda-990f-0f07-a320d5392fc9.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.TorsionalModulus Property

Section modulus for calculations of torsion stresses (Ct)

## Syntax (C#)
```csharp
public double TorsionalModulus { get; set; }
```